<template>
  <div class="rules flex flex-col min-h-screen">
    <Header />
    <div class="flex-grow flex items-center justify-center bg-gray-100">
      <div
        class="bg-white shadow-lg rounded-lg p-6 sm:p-8 max-w-md sm:max-w-2xl w-full my-4 sm:my-8"
      >
        <h2 class="text-xl sm:text-2xl font-bold text-center mb-4">
          Обрабатываемые данные:
        </h2>

        <div class="mb-4">
          <p class="text-black mb-3 text-sm sm:text-base">
            1 Мы не осуществляем сбор ваших персональных данных с использованием
            Сайта.
          </p>
          <p class="text-black mb-3 text-sm sm:text-base">
            2 Все данные, собираемые на Сайте, предоставляются и принимаются в
            обезличенной форме (далее – «Обезличенные данные»).
          </p>
          <p class="text-black mb-3 text-sm sm:text-base">
            3 Обезличенные данные включают следующие сведения, которые не
            позволяют вас идентифицировать:
          </p>
          <p class="text-black mb-3 text-sm sm:text-base">
            4 Информацию, которую вы предоставляете о себе самостоятельно с
            использованием онлайн-форм и программных модулей Сайта, включая имя
            и номер телефона и/или адрес электронной почты.
          </p>
          <p class="text-black mb-3 text-sm sm:text-base">
            5 Данные, которые передаются в обезличенном виде в автоматическом
            режиме в зависимости от настроек используемого вами программного
            обеспечения.
          </p>
          <p class="text-black mb-3 text-sm sm:text-base">
            6 Администрация вправе устанавливать требования к составу
            Обезличенных данных Пользователя, которые собираются использованием
            Сайта.
          </p>
          <p class="text-black mb-3 text-sm sm:text-base">
            7 Если определенная информация не помечена как обязательная, ее
            предоставление или раскрытие осуществляется Пользователем на свое
            усмотрение. Одновременно вы даете информированное согласие на доступ
            неограниченного круга лиц к таким данным. Указанные данные
            становится общедоступными с момента предоставления и/или раскрытия в
            иной форме.
          </p>
          <p class="text-black mb-3 text-sm sm:text-base">
            8 Администрация не осуществляет проверку достоверности
            предоставляемых данных и наличия у Пользователя необходимого
            согласия на их обработку в соответствии с настоящей Политикой,
            полагая, что Пользователь действует добросовестно, осмотрительно и
            прилагает все необходимые усилия к поддержанию такой информации в
            актуальном состоянии и получению всех необходимых согласий на ее
            использование.
          </p>
          <p class="text-black mb-3 text-sm sm:text-base">
            9 Вы осознаете и принимаете возможность использования на Сайте
            программного обеспечения третьих лиц, в результате чего такие лица
            могут получать и передавать указанные в п.1.3 данные в обезличенном
            виде.
          </p>
          <p class="text-black mb-3 text-sm sm:text-base">
            > Пример! К указанному программному обеспечению третьих лиц
            относятся системы сбора статистики посещений Google Analytics и
            Яндекс.Метрика.
          </p>
        </div>

        <h2 class="text-lg font-bold text-center mb-2 p-4 rounded-t">
          Состав и условия сбора обезличенных данных с использованием
          программного обеспечения третьих лиц определяются непосредственно их
          правообладателями и могут включать:
        </h2>
        <div class="p-4">
          <p class="text-black mb-3 text-sm sm:text-base">
            1 Данные браузера (тип, версия, cookie);
          </p>
          <p class="text-black mb-3 text-sm sm:text-base">
            2 Данные устройства и место его положения;
          </p>
          <p class="text-black mb-3 text-sm sm:text-base">
            3 Данные операционной системы (тип, версия, разрешение экрана);
          </p>
          <p class="text-black mb-3 text-sm sm:text-base">
            4 Данные запроса (время, источник перехода, IP-адрес).
          </p>
          <p class="text-black mb-3 text-sm sm:text-base">
            5 Администрация не несет ответственность за порядок использования
            Обезличенных данных Пользователя третьими лицами.
          </p>
        </div>

        <h2 class="text-lg font-bold text-center mb-2 p-4 rounded-t">
          Администрация использует данные в следующих целях:
        </h2>
        <div class="p-4">
          <p class="text-black mb-3 text-sm sm:text-base">
            1 Обработка поступающих запросов и связи с Пользователем;
          </p>
          <p class="text-black mb-3 text-sm sm:text-base">
            2 Информационное обслуживание, включая рассылку
            рекламно-информационных материалов;
          </p>
          <p class="text-black mb-3 text-sm sm:text-base">
            3 Проведение маркетинговых, статистических и иных исследований;
          </p>
          <p class="text-black mb-3 text-sm sm:text-base">
            4 Таргетирование рекламных материалов на Сайте.
          </p>
        </div>

        <h2 class="text-lg font-bold text-center mb-2 p-4 rounded-t">
          Требования к защите данных:
        </h2>
        <div class="p-4">
          <p class="text-black mb-3 text-sm sm:text-base">
            1 Администрация осуществляет хранение данных и обеспечивает их
            охрану от несанкционированного доступа и распространения в
            соответствии с внутренними правилами и регламентами.
          </p>
          <p class="text-black mb-3 text-sm sm:text-base">
            1 Администрация осуществляет хранение данных и обеспечивает их
            охрану от несанкционированного доступа и распространения в
            соответствии с внутренними правилами и регламентами.
          </p>
          <p class="text-black mb-3 text-sm sm:text-base">
            3 В целях повышения качества работы Администрация вправе хранить
            лог-файлы о действиях, совершенных Пользователем в рамках
            использования Сайта в течение 1 (Одного) года.
          </p>
        </div>

        <h2 class="text-lg font-bold text-center mb-2 p-4 rounded-t">
          Администрация вправе передать данные третьим лицам в следующих
          случаях:
        </h2>
        <div class="p-4">
          <p class="text-black mb-3 text-sm sm:text-base">
            1 Пользователь выразил свое согласие на такие действия, включая
            случаи применения Пользователем настроек используемого программного
            обеспечения, не ограничивающих предоставление определенной
            информации;
          </p>
          <p class="text-black mb-3 text-sm sm:text-base">
            2 Передача необходима в рамках использования Пользователем
            функциональных возможностей Сайта;
          </p>
          <p class="text-black mb-3 text-sm sm:text-base">
            3 Передача требуется в соответствии с целями обработки данных;
          </p>
          <p class="text-black mb-3 text-sm sm:text-base">
            4 В связи с передачей Сайта во владение, пользование или
            собственность такого третьего лица;
          </p>
          <p class="text-black mb-3 text-sm sm:text-base">
            5 По запросу суда или иного уполномоченного государственного органа
            в рамках установленной законодательством процедуры;
          </p>
          <p class="text-black mb-3 text-sm sm:text-base">
            6 Для защиты прав и законных интересов Администрации в связи с
            допущенными Пользователем нарушениями.
          </p>
          <p class="text-black mb-3 text-sm sm:text-base">
            Настоящая Политика может быть изменена или прекращена Администрацией
            в одностороннем порядке без предварительного уведомления
            Пользователя. Новая редакция Политики вступает в силу с момента ее
            размещения на Сайте, если иное не предусмотрено новой редакцией
            Политики.
          </p>
          <p class="text-black mb-3 text-sm sm:text-base">
            Действующая редакция Политики находится на Сайте в сети Интернет по
            адресу. Действующая редакция Политики от __________ 20__ г.
          </p>
        </div>
      </div>
    </div>
    <Footer />
  </div>
</template>

<script setup>
import Footer from "/src/views/MainForm/Footer.vue";
import Header from "/src/views/MainForm/Header.vue";
</script>

<script>
import Footer from "/src/views/MainForm/Footer.vue";
import Header from "/src/views/MainForm/Header.vue";
export default {
  name: "Footer",
  name: "Header",
};
</script>
