<template>
  <div class="rules flex flex-col min-h-screen">
    <Header />
    <div class="flex-grow flex items-center justify-center bg-gray-100">
      <div
        class="bg-white shadow-lg rounded-lg p-6 sm:p-8 max-w-md sm:max-w-2xl w-full my-4 sm:my-8"
      >
        <h2 class="text-xl sm:text-2xl font-bold text-center mb-4">Правила</h2>
        <div class="mb-4">
          <p class="text-black mb-3 text-sm sm:text-base">
            1. Публикуя отзыв, автор обязан делиться личным опытом
            взаимодействия с продуктом. В случае обнаружения факта публикации
            отзывов заказного/фейкового характера, такие отзывы будут удалены с
            сайта, а профиль автора удален с нашей площадки.
          </p>
          <p class="text-black mb-3 text-sm sm:text-base">
            2. Запрещается копировать текст с других сайтов (в том числе
            запрещается копировать свои тексты, ранее опубликованные на других
            сайтах). Отзыв должен содержать личное мнение автора, а не пересказ
            впечатлений своих знакомых, друзей (подруг) или просто соседей по
            кинозалу. Все отзывы проверяются на плагиат - копии и рерайты
            удаляются без объяснения причин, аккаунт в этом случае блокируется!
          </p>
          <p class="text-black mb-3 text-sm sm:text-base">
            3. Запрещается упоминать в отзывах фамилии, имена или любые другие
            персональные данные. Мы не размещаем отзывы о людях.
          </p>
          <p class="text-black mb-3 text-sm sm:text-base">
            4. В отзывах запрещена реклама сторонних интернет-ресурсов, а также
            любое размещение ссылок на них. Запрещается использовать в отзывах
            реферальные ссылки и коды. За использование реферальных ссылок
            (партнерские программы и т.п.), а также размещение в отзывах
            недостоверной, или рекламной информации аккаунт может быть закрыт.
          </p>
          <p class="text-black mb-3 text-sm sm:text-base">
            5. Любые оскорбления, угрозы, призывы к насилию и прочее недостойное
            поведение пресекаются администрацией сайта. Все активные участники
            конфликта, опустившиеся до угроз и оскорблений, могут быть
            заблокированы независимо от того, кто был инициатором конфликта.
          </p>
          <p class="text-black mb-3 text-sm sm:text-base">
            6. Обращение к авторам предыдущих отзывов, попытка похвалить автора,
            оскорбить, вступить с ним в дискуссию — на 100% закроют доступ к
            публикации отзыва. Никакой полемики — только ваше мнение о сервисе и
            ничего больше.
          </p>
          <p class="text-black mb-3 text-sm sm:text-base">
            7. Не принимаются отзывы с аккаунтов под никами, не несущей
            смысловой нагрузки. К примеру: "варвар", "qwerasdf". Кроме того,
            запрещено использовать рекламные тексты в имени пользователя.
          </p>
          <p class="text-black mb-3 text-sm sm:text-base">
            8. Отзыв не должен содержать избыточное визуальное выделение
            (заглавными буквами, полужирным шрифтом, цветом и т. д.). Если отзыв
            частично или полностью набран ПРОПИСНЫМИ (ЗАГЛАВНЫМИ) буквами, то он
            не будет опубликован на портале.
          </p>
          <p class="text-black mb-3 text-sm sm:text-base">
            9. Запрещается использование аватаров, содержащих грубый,
            нецензурный или безграмотный текст либо неприличные изображения;
            аватаров, оскорбительных для посетителей сайта; аватаров, содержащих
            информацию рекламного характера.
          </p>
          <p class="text-black mb-3 text-sm sm:text-base">
            10. Отзыв должен быть оставлен пользователем портала от своего имени
            и описывать ситуацию, в которой он участвовал или при которой
            присутствовал.
          </p>
          <p class="text-black mb-3 text-sm sm:text-base">
            11. Оценка должна соответствовать содержанию отзыва (где 1 – плохо,
            а 5 – отлично). Мы публикуем как негативные, так и позитивные мнения
            пользователей о том или ином сервисе. Но помните, что похвалить
            сервис гораздо проще, чем обругать. Если вы ставите отрицательную
            оценку сервису, необходимо максимально аргументировать свое мнение,
            используя при этом всё богатство литературного русского языка. Отзыв
            в стиле: «Сервис го***, потому что го***» на сайте не публикуются.
            Всячески приветствуются содержательные интересные отзывы. Большие по
            объему тексты следует разбивать на абзацы, тем самым повышая их
            читабельность.
          </p>
          <p class="text-black mb-3 text-sm sm:text-base">
            12. Ваш отзыв может подвергнуться редакторской правке (удаление
            нескольких случайных описок автора, цитат, неточностей, спойлеров и
            т.д.).
          </p>
          <p class="text-black mb-3 text-sm sm:text-base">
            13. Отзыв должен быть написан грамотным русским языком и оформлен в
            соответствии с элементарными правилами типографии (пробел ставится
            после знака препинания, а не до него; многоточие — это три точки, а
            не пять и т.д.). Отзывы, содержащие большое количество
            орфографических ошибок, не публикуются на портале.
          </p>
        </div>
      </div>
    </div>
    <Footer />
  </div>
</template>

<script setup>
import Footer from "/src/views/MainForm/Footer.vue";
import Header from "/src/views/MainForm/Header.vue";
</script>

<script>
import Footer from "/src/views/MainForm/Footer.vue";
import Header from "/src/views/MainForm/Header.vue";
export default {
  name: "Footer",
  name: "Header",
};
</script>
