<template>
  <div class="register">
    <div class="flex items-center justify-center min-h-screen bg-gray-100 px-4">
      <div class="container max-w-xl mx-auto">
        <!-- Уменьшили максимальную ширину для мобильных -->
        <div class="card bg-gray-200 shadow-md rounded">
          <h2 class="text-lg font-bold text-center bg-gray-300 p-4 rounded-t">
            <!-- Добавили отступы и скругление только сверху -->
            Реквезиты
          </h2>
          <div class="card-body p-4">
            <div class="mb-4">
              <label for="username" class="block mb-2">
                Получатель Наименование: ИП РОГАЧЁВ СТЕПАН ДМИТРИЕВИЧ ИНН:
                662306435663 ОГРНИП: 324665800138821 Расчётный счёт: 40802 810 0
                1654 0428729
              </label>
              <div>
                <label>
                  Банк получателя Наименование: УРАЛЬСКИЙ БАНК ПАО СБЕРБАНК БИК:
                  046577674 Корсчёт: 30101 810 5 0000 0000674 ИНН: 7707083893
                  КПП: 665843001
                </label>
              </div>
              <div>
                <label>
                  Детали счёта Дата открытия: 26.06.2024 Обслуживающее
                  подразделение: г.Нижний Тагил, ул.Ломоносова, 49, Первый этаж
                  помещения №16, 1 Второй этаж помещения № 2-13, 13.1, 13.2,
                  13.3, 23
                </label>
              </div>
            </div>
          </div>
          <h2 class="text-lg font-bold text-center bg-gray-300 p-4 rounded-t">
            <!-- Добавили отступы и скругление только сверху -->
            Способы оплаты:
          </h2>
          <div class="p-4">
            <div>
              <label>
                Наличный расчёт Если товар доставляется курьером, то оплата
                осуществляется наличными курьеру в руки. При получении товара
                обязательно проверьте комплектацию товара, наличие гарантийного
                талона и чека.
              </label>
            </div>
            <div>
              <label>
                Банковской картой Для выбора оплаты товара с помощью банковской
                карты на соответствующей странице необходимо нажать кнопку
                Оплата заказа банковской картой. Оплата происходит через ПАО
                СБЕРБАНК с использованием банковских карт следующих платёжных
                систем:
              </label>
            </div>
            <ul>
              <li>МИР</li>
              <li>VISA International</li>
              <li>Mastercard Worldwide</li>
              <li>JCB</li>
            </ul>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>
