<template>
  <div class="register">
    <div class="flex items-center justify-center min-h-screen bg-gray-100 px-4">
      <div class="container max-w-xl mx-auto">
        <!-- Уменьшили максимальную ширину для мобильных -->
        <div class="card bg-gray-200 shadow-md rounded">
          <h2 class="text-lg font-bold text-center bg-gray-300 p-4 rounded-t">
            <!-- Добавили отступы и скругление только сверху -->
            Регистрация организации:
          </h2>
          <div class="card-body p-4">
            <div class="mb-4">
              <label for="username" class="block mb-2">
                1 Право публиковать комментарии имеют все, кроме организаций.
              </label>
              <label>
                2 При регистрации не допускается использование вместо имени,
                фамилии или логина нецензурных выражений, адресов веб-сайтов,
                e-mail и т.п.
              </label>
            </div>
          </div>
          <h2 class="text-lg font-bold text-center bg-gray-300 p-4 rounded-t">
            Общее положения:
          </h2>
          <div class="p-4">
            <label class="block mb-2">
              1 Старайтесь писать грамотно. Проверяйте написанные сообщения
              перед тем как их отправить.
            </label>
            <label class="block mb-2">
              2 При подготовке сообщения избегайте излишнего цитирования. Это
              затрудняет чтение сообщения и излишне загружает тему.
            </label>
            <label class="block mb-2"
              >3 Личная переписка в общей теме не допускается.</label
            >
            <label class="block mb-2">
              4 Избегайте копирования объёмных материалов каких-либо
              веб-страниц. Лучше публикуйте ссылки на эти материалы.
            </label>
            <label class="block mb-2">
              5 Если Вам нечего сказать, лучше ничего не говорить. Не надо
              писать сообщения только для того, чтобы отметиться.
            </label>
            <label class="block mb-2">
              6 Оставляя комментарий, следуйте правилу: обсуждаем предмет
              дискуссии и аргументы оппонентов, а не личностные и
              профессиональные качества участников дискуссии.
            </label>
          </div>
          <h2
            class="text-lg font-bold text-center mb-2 bg-gray-300 p-4 rounded-t"
          >
            В комментариях запрещено:
          </h2>
          <div class="p-4">
            <label class="block mb-2"
              >1 Публиковать сообщения, нарушающие действующее законодательство
              РФ.</label
            >
            <label class="block mb-2"
              >2 Публиковать заведомо ложную информацию.</label
            >
            <label class="block mb-2">
              3 Использовать нецензурные и/или грубые выражения (в том числе в
              замаскированной форме).
            </label>
            <label class="block mb-2">
              4 Оскорблять кого-либо в прямой или косвенной форме, проявлять
              неуважение к авторам публикаций и участникам дискуссии.
            </label>
            <label class="block mb-2">
              5 Рекламировать в сообщениях, подписях или аватарах любые товары и
              услуги без специального разрешения администрации сайта.
            </label>
            <label class="block mb-2">
              6 Публиковать сообщения, не несущие конкретной смысловой нагрузки
              в контексте обсуждаемой темы.
            </label>
            <label class="block mb-2">
              7 Публиковать сообщения, включающие специально сделанные ошибки;
              злостно нарушать правила русского языка.
            </label>
            <label class="block mb-2">
              8 Размещать в подписях к сообщениям ссылки на сайты, не отвечающие
              тематике форума.
            </label>
            <label class="block mb-2">
              9 Публиковать сообщения, набранные ЗАГЛАВНЫМИ или заглавными и
              прописными буквами вперемешку («вОт ТаКиМ оБрАзОм»), а также
              использовать в текстах особое форматирование и выделение цветом,
              отличное от стандартного, с целью привлечения дополнительного
              внимания аудитории.
            </label>
          </div>

          <h2
            class="text-lg font-bold text-center mb-2 bg-gray-300 p-4 rounded-t"
          >
            Не рекомендуется:
          </h2>
          <div class="p-4">
            <label class="block mb-2">
              1 Набирать сообщения транслитом, так как это неудобно для чтения.
              Существуют методы, которые позволяют переводить транслит в
              кириллицу. (Администрация сайта оставляет за собой право удалять
              такие комментарии.)
            </label>
            <label class="block mb-2">
              2 Создавать аватары и подписи на политические или религиозные
              темы. (Администрация оставляет за собой право удалять такие
              аватары и подписи после уведомления пользователя через
              Персональные сообщения.)
            </label>
            <label class="block mb-2">
              3 Публиковать сообщения политического или религиозного содержания.
              (Администрация оставляет за собой право удалять подобные сообщения
              без предупреждения.)
            </label>
            <label class="block mb-2">
              4 Использовать подписи на любом языке, кроме русского и
              английского. Пользователи русскоязычного форума должны понимать
              то, что пишут остальные участники форума. Английский считается
              международным языком.
            </label>
          </div>

          <h2
            class="text-lg font-bold text-center mb-2 bg-gray-300 p-4 rounded-t"
          >
            Администрирование:
          </h2>
          <div class="p-4">
            <label class="block mb-2"
              >1 Администрирование осуществляют сотрудники сайта.</label
            >
            <label class="block mb-2">
              2 Решение администрации сайта является окончательным и обжалованию
              не подлежит.
            </label>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>
